import numpy as np
import matplotlib.pyplot as plt

a = np.arange(0, 90, 0.1)
plt.xlabel(r'$Q, мВт$')
plt.ylabel(r'$R, Ом$')
plt.grid(True)

# 25 ˚C
#plt.title(r'$Зависимость\;сопротивления\; R(Q)\; от\; подаваемой\;мощности \; Q. \; Т = 25 ˚C.$')
x1 = [10.64
    , 22.34155
    , 34.40601
    , 44.430075
    , 55.678638
    , 67.498496
    , 77.872605
    , 88.4184]
y1 = [15.03759398
    , 15.07272727
    , 15.12159329
    , 15.15235457
    , 15.19160885
    , 15.2358774
    , 15.27097045
    , 15.30789474]
p1, v1 = np.polyfit(x1, y1, deg=1, cov=True)
#plt.plot(a, p1[0]*a + p1[1])
#plt.errorbar(x1, y1, fmt = 'o', ms= 4 )
# print (p1[0], v1[0][0]**(1/2))
# print (p1[1], v1[1][1]**(1/2))
#plt.show()


# 35 ˚C
#plt.title(r'$Зависимость\;сопротивления\; R(Q)\; от\; подаваемой\;мощности \; Q. \; Т = 35˚C.$')
x2 = [10.553662
    , 21.680008
    , 33.408563
    , 43.185234
    , 54.06072
    , 65.159829
    , 75.88705
    , 86.152859]
y2 = [15.48065875
    , 15.53265525
    , 15.5644291
    , 15.59673128
    , 15.63605442
    , 15.6770591
    , 15.71079137
    , 15.74557253]
p2, v2 = np.polyfit(x2, y2, deg=1, cov=True)
#plt.plot(a, p2[0]*a + p2[1])
#plt.errorbar(x2, y2, fmt = 'o', ms= 4 )
# print (p2[0], v2[0][0]**(1/2))
# print (p2[1], v2[1][1]**(1/2))
#plt.show()


# 45 ˚C
#plt.title(r'$Зависимость\;сопротивления\; R(Q)\; от\; подаваемой\;мощности \; Q. \; Т,˚C.$')
x3 = [10.659492
    , 21.305768
    , 32.73204
    , 42.01057
    , 52.698625
    , 63.177318
    , 73.732384
    , 83.391264]
y3 = [15.93967517
    , 15.97480832
    , 16.01415616
    , 16.04455736
    , 16.07860262
    , 16.11146599
    , 16.14917863
    , 16.18052654]
p3, v3 = np.polyfit(x3, y3, deg=1, cov=True)
#plt.plot(a, p3[0]*a + p3[1])
#plt.errorbar(x3, y3, fmt = 'o', ms= 4 )
# print (p3[0], v3[0][0]**(1/2))
# print (p3[1], v3[1][1]**(1/2))
#plt.show()


# 55 ˚C
#plt.title(r'$Зависимость\;сопротивления\; R(Q)\; от\; подаваемой\;мощности \; Q. \; Т = 55 ˚C.$')
x4 = [10.32363
    , 20.507802
    , 31.701747
    , 41.097383
    , 52.273125
    , 61.68092
    , 72.419327
    , 81.093488]
y4 = [16.38645418
    , 16.4204867
    , 16.45705172
    , 16.48507911
    , 16.52088889
    , 16.55471822
    , 16.58998032
    , 16.61608932]
p4, v4 = np.polyfit(x4, y4, deg=1, cov=True)
#plt.plot(a, p4[0]*a + p4[1])
#plt.errorbar(x4, y4, fmt = 'o', ms= 4 )
# print (p4[0], v4[0][0]**(1/2))
# print (p4[1], v4[1][1]**(1/2))
#plt.show()


# 65 ˚C
#plt.title(r'$Зависимость\;сопротивления\; R(Q)\; от\; подаваемой\;мощности \; Q. \; Т = 65 ˚C.$')
x5 = [9.55182
    , 20.14848
    , 30.82086
    , 40.033708
    , 50.566717
    , 60.086115
    , 70.226477
    , 80.025728]
y5 = [16.83459278
    , 16.86921296
    , 16.90398126
    , 16.93541752
    , 16.96830921
    , 17.00084104
    , 17.0331724
    , 17.06483645]
p5, v5 = np.polyfit(x5, y5, deg=1, cov=True)
#plt.plot(a, p5[0]*a + p5[1])
#plt.errorbar(x5, y5, fmt = 'o', ms= 4 )
# print (p5[0], v5[0][0]**(1/2))
# print (p5[1], v5[1][1]**(1/2))
#plt.show()


# 70 ˚C
#plt.title(r'$Зависимость\;сопротивления\; R(Q)\; от\; подаваемой\;мощности \; Q. \; Т = 70 ˚C.$')
x6 = [9.575498
    , 19.754988
    , 30.620388
    , 39.281424
    , 49.43764
    , 59.232264
    , 69.078186
    , 78.827769]
y6 = [17.0620515
    , 17.09914681
    , 17.13744973
    , 17.16346154
    , 17.19507646
    , 17.22544338
    , 17.25620357
    , 17.28565082]
p6, v6 = np.polyfit(x6, y6, deg=1, cov=True)
#plt.plot(a, p6[0]*a + p6[1])
#plt.errorbar(x6, y6, fmt = 'o', ms= 4 )
# print (p6[0], v6[0][0]**(1/2))
# print (p6[1], v6[1][1]**(1/2))
#plt.show()


b = np.arange(273, 90 + 273, 0.1)
plt.xlabel(r'$T, K$')
plt.ylabel(r'$R, Ом$')
plt.title(r'$Зависимость\;сопротивления\; R(T)\; от\; температуры \; Т.$')
x = [25 + 273, 35 + 273, 45 + 273, 55 + 273, 65 + 273, 70 + 273]
y = [14.998174138255159, 15.449994449724684, 15.904876160221358, 16.352998422239956, 16.803472775077942, 17.03576391951743]
p, v = np.polyfit(x, y, deg=1, cov=True)
plt.plot(b, p[0]*b + p[1])
plt.errorbar(x, y, yerr = [0.0018329900737058475, 0.0033347512763773762, 0.0008898913772051953, 0.0011252495369063844, 0.0004810918755788144, 0.00211241136157276], fmt = 'o', ms= 4 )
plt.show()

# print (p[0], v[0][0]**(1/2))
# print (p[1], v[1][1]**(1/2))

c = np.arange(0, 0.2, 0.001)

#plt.xlabel(r'$ln (T/Т_{0}) $')
#plt.ylabel(r'$ln (\varkappa/\varkappa_{0}) $')
#plt.title(r'$Зависимость\; ln (\varkappa/\varkappa_{0}) \; от\; ln (T/Т_{0}).$')

x0 = [0.0169, 0.0499, 0.0819, 0.1128, 0.1429, 0.1576]
y0 = [0.127, 0.144, 0.186, 0.1957, 0.202, 0.218]
p0, v0 = np.polyfit(x0, y0, deg=1, cov=True)
#plt.plot(c, p0[0] * c + p0[1])
#plt.errorbar(x0, y0, yerr = [0.010, 0.020, 0.006, 0.0060, 0.003, 0.010], fmt='o', ms=4)
#plt.show()
#print(p0[0], v0[0][0] ** (1 / 2))


#plt.xlabel(r'$ T, K $')
#plt.ylabel(r'$\varkappa, мВт/м*К $')
#plt.title(r'$Зависимость\; коэффициента \;теплопроводности\;\varkappa (Т) \; от\;температуры\; T.$')

y10 = [29.4, 29.9, 31.2, 31.5, 31.7, 32.2]
x10 = [25 + 273, 35 + 273, 45 + 273, 55 + 273, 65 + 273, 70 + 273]
#plt.plot(b, 0.812066 * (b**(0.63)) )
#plt.errorbar(x10, y10, yerr = [0.3, 0.6, 0.2, 0.2, 0.1, 0.3], fmt='o', ms=4)
#plt.show()